In [1]:
import numpy as np
import pandas as pd

from datetime import datetime

In [7]:
myYear = 2015
myMonth = 1
myDay = 1
myHour = 2
myMin = 30
mySec = 15

In [14]:
myDate=datetime(myYear, myMonth, myDay)
myDate

datetime.datetime(2015, 1, 1, 0, 0)

In [15]:
myDateTime=datetime(myYear, myMonth, myDay, myHour, myMin, mySec)
myDateTime

datetime.datetime(2015, 1, 1, 2, 30, 15)

In [16]:
myDateTime.year

2015

In [17]:
mySer=pd.Series(['Nov 3, 1990', '2000-12-01', None])
mySer

0    Nov 3, 1990
1     2000-12-01
2           None
dtype: object

In [22]:
# Converting it to timestamps.
# Default format is year, month and day.
timeser=pd.to_datetime(mySer)
timeser

0   1990-11-03
1   2000-12-01
2          NaT
dtype: datetime64[ns]

In [23]:
timeser[0]

Timestamp('1990-11-03 00:00:00')

In [24]:
timeser[0].year

1990

In [25]:
obvi_euro_date='31-12-2000'

In [26]:
# it can convert only because 13 is way greater for month.
pd.to_datetime(obvi_euro_date)

Timestamp('2000-12-31 00:00:00')

In [28]:
# here we meant 10th of dec.
# but it is showing 12th of october.
euro_date='10-12-2000'
pd.to_datetime(euro_date)

Timestamp('2000-10-12 00:00:00')

In [30]:
# to keep day as first.
# Now it is showing correct.
pd.to_datetime(euro_date, dayfirst=True)

Timestamp('2000-12-10 00:00:00')

In [34]:
style_date='1--Dec--2000'

In [37]:
pd.to_datetime(style_date, format='%d--%b--%Y')

Timestamp('2000-12-01 00:00:00')

In [40]:
custom_date='1st of Dec 2000'
pd.to_datetime(custom_date)

Timestamp('2000-12-01 00:00:00')

In [43]:
sales=pd.read_csv('./Docs/03-Pandas/RetailSales_BeerWineLiquor.csv')
sales

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [49]:
sales['DATE']=pd.to_datetime(sales['DATE'])
sales['DATE'][0]

Timestamp('1992-01-01 00:00:00')

In [62]:
# here in parse dates we specified the column index or column number.
sales=pd.read_csv('./Docs/03-Pandas/RetailSales_BeerWineLiquor.csv', parse_dates=[0])
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   DATE           340 non-null    datetime64[ns]
 1   MRTSSM4453USN  340 non-null    int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 5.4 KB

In [58]:
sales=sales.set_index("DATE")
sales

            MRTSSM4453USN
DATE
1992-01-01           1509
1992-02-01           1541
1992-03-01           1597
1992-04-01           1675
1992-05-01           1822
...                   ...
2019-12-01           6630
2020-01-01           4388
2020-02-01           4533
2020-03-01           5562
2020-04-01           5207

[340 rows x 1 columns]

In [61]:
# Here instead of group by we can resample as well 
# Rule='A' is defined for the frequency per year or something which based only on year
# It will change all indexes as well to last day of year.
sales.resample(rule='A').mean().head()

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000